In [2]:
import pandas as pd
import numpy as np

### Crear dataframes

In [2]:
datos = {
    'Nombre': ['Armando', 'Mario', 'Juan'],
    'Codigo Pais': [110, 111, 112],
    'Otros': [[1, 2], [1, 1], [0, 1]]
}

df = pd.DataFrame(datos)

df

    Nombre  Codigo Pais   Otros
0  Armando          110  [1, 2]
1    Mario          111  [1, 1]
2     Juan          112  [0, 1]

In [3]:
df['Otros'][0]

[1, 2]

### Agregar un array como atributo a un dataframe

In [4]:
df['Otros'] = [np.append(df['Otros'][0], [1]) for i in df['Otros']]

In [5]:
df['Otros']

0    [1, 2, 1]
1    [1, 2, 1]
2    [1, 2, 1]
Name: Otros, dtype: object

In [6]:
df['Anomalias'] = pd.Series([[] for i in df], dtype='object')
df

    Nombre  Codigo Pais      Otros Anomalias
0  Armando          110  [1, 2, 1]        []
1    Mario          111  [1, 2, 1]        []
2     Juan          112  [1, 2, 1]        []

In [7]:
df

    Nombre  Codigo Pais      Otros Anomalias
0  Armando          110  [1, 2, 1]        []
1    Mario          111  [1, 2, 1]        []
2     Juan          112  [1, 2, 1]        []

### De acuerdo a una condici√≥n, agregar un objeto al dataframe de cada fila

In [8]:
anomalias = []
for i in range(len(df)):
    if df.iloc[i]['Nombre'] == 'Armando':
        anomalias.append(np.append(df.iloc[i]['Anomalias'], '1'))
    else:
        anomalias.append(df.iloc[i]['Anomalias'])
        
df['Anomalias'] = anomalias

In [9]:
df

    Nombre  Codigo Pais      Otros Anomalias
0  Armando          110  [1, 2, 1]       [1]
1    Mario          111  [1, 2, 1]        []
2     Juan          112  [1, 2, 1]        []

### Entendiendo la concatenacion con pd.concat()

In [5]:
datos1 = {
    'Nombre': ['Armando', 'Mario', 'Juan'],
    'Codigo Pais': [110, 111, 112],
    'Otros': [[1, 2], [3, 4], [5, 6]]
}

df1 = pd.DataFrame(datos1)

datos2 = {
    'Nombre': ['Jorge', 'Rafael', 'Sandro'],
    'Codigo Pais': [210, 211, 212],
    'Otros': [['a', 'b'], ['c', 'd'], ['e', 'f']]
}

df2 = pd.DataFrame(datos2)

In [7]:
df = pd.concat([df1, df2], ignore_index=True)

df

    Nombre  Codigo Pais   Otros
0  Armando          110  [1, 2]
1    Mario          111  [3, 4]
2     Juan          112  [5, 6]
3    Jorge          210  [a, b]
4   Rafael          211  [c, d]
5   Sandro          212  [e, f]